import os

# --- Шляхи та папки ---
BASE_DIR = os.path.dirname(os.path.abspath(__file__))
INPUT_FOLDER = os.path.join(BASE_DIR, 'input_data')
OUTPUT_FOLDER = os.path.join(BASE_DIR, 'output')
ARCHIVE_FOLDER = os.path.join(INPUT_FOLDER, 'processed_archive')
OUTPUT_FILE = os.path.join(OUTPUT_FOLDER, 'Total_Ledger.xlsx')
LOG_FILE = os.path.join(BASE_DIR, 'automation.log')

# --- Константи назв колонок ---
COL_ID = 'ID_Транзакції'
COL_DATE = 'Дата'
COL_CAT = 'Категорія'
COL_CARD = 'Картка'
COL_DESC = 'Опис операції'
COL_AMOUNT = 'Сума'
COL_BALANCE = 'Залишок'
COL_MCC = 'MCC'

USEFUL_COLUMNS = [COL_DATE, COL_CAT, COL_CARD, COL_DESC, COL_AMOUNT, COL_BALANCE]

# --- Словник карток ---
CARDS_DICTIONARY = {
    '4169': 'Приват Sid Унів',
    '4882': 'Приват Sid Кешбек',
    '0707': 'Приват Sid Виплати',
    '0627': 'Приват Olenka Виплати',
    '6333': 'Приват Olenka Кешбек',
    '4258': 'Приват Olenka Унів',
    '9948': 'А-Банк Sid АТБ',
    '0430': 'А-Банк Sid АТБ',
    '4907': 'А-Банк Sid Спорт',
    '0956': 'А-Банк Sid Кешбек',
    '5191': 'А-Банк Sid Кешбек',
    '5993': 'Альянс Sid',
    '0550': 'Альянс Olenka',
    '4805': 'ПУМБ Sid',
    '8169': 'ПУМБ Sid кредит',
    '0950': 'ПУМБ Olenka',
    '7854': 'Monobank Sid Чорна',
}

IBAN_TO_CARD_MAP = {
    'UA093052990262006400941962343': 'Приват Olenka Виплати',
    'UA173052990000026201664106959': 'Приват Olenka Унів',
    'UA693052990262076401003353719': 'Приват Olenka Кешбек',
    'UA703052990000026203685207802': 'Приват Sid Унів',
    'UA503052990262056401002870255': 'Приват Sid Кешбек',
    'UA093052990262006400928529686': 'Приват Sid Виплати',
    'UA823077700000026202412881084': 'А-Банк Sid АТБ',
    'UA703077700000026201117655044': 'А-Банк Sid Кешбек',
    'UA983077700000026207321065082': 'А-Банк Sid Спорт',
    'UA903001190000262071247640001': 'Альянс Sid',
    'UA373001190000262041247667001': 'Альянс Olenka',
    'UA773220010000026201300425413': 'Monobank Sid Чорна',
    'UA363348510000026203122871748': 'ПУМБ Sid',
    'UA233348510000026200123291900': 'ПУМБ Sid кредит',
    'UA913348510000026209122872688': 'ПУМБ Olenka',
}

MCC_MAP = {
    '5411': 'Продукти', '5499': 'Продукти',
    '5814': 'Ресторани та Розваги', '5812': 'Ресторани та Розваги',
    '5310': 'Техніка і цифрові товари',
    '4814': 'Компослуги',
    '6010': 'Інші витрати',      # Замість "Переказ коштів"
    '5719': 'Одяг та взуття',
    '5912': 'Здоров\'я та краса', '5995': 'Здоров\'я та краса',
    '5541': 'Витрати на авто', '5542': 'Витрати на авто',
    '4121': 'Громадський транспорт', '4111': 'Громадський транспорт',
    '4112': 'Громадський транспорт',
    '4215': 'Поштові послуги', '9402': 'Поштові послуги'
}

### --- НОВИЙ ГРУПОВАНИЙ СЛОВНИК ---
CATEGORIES_KEYWORDS = {
    # ВИТРАТИ
    'Витрати на авто': ['укрнафта', 'wog', 'amic', 'azs', 'AZK', 'strakhovyi', 'avtomyika', 'doktor kolesa', 'авто'],
    'Громадський транспорт': ['укрзалізниця', 'uz', 'KYIVTRANS', 'VOKZAL', 'леокарт', 'kyivtrans', 'bolt', 'uklon', 'квиток', 'МЕТАЛУРГIВ'],
    'Житло та Побут': ['епіцентр', 'brazzers', 'господар', 'грядка', 'альфа', 'eva', 'ТАКЕ', 'POSUD', 'астра'],
    'Зв\'язок': ['vodafone', 'київстар', 'kyivstar', 'plus380'],
    'Оплата Кредитів': ['кредит'],
    'Здоров\'я та краса': ['makeup', 'Vetapteka', 'medical', 'MEDYCHNYI', 'аптека', 'APTEKA', 'герц', 'men\'s hall', 'wfp consult', 'конекс', 'фарм'],
    'Одяг та взуття': ['sinsay', 'bershka', 'deva', 'vzuttya', 'lileya', 'dzhins', 'глобус', 'lpp'],
    'Компослуги': ['нафтогаз', 'газ', 'Комунальні', 'електроенергію', 'ipay', 'portmone', 'хмельницькенергозбут', 'шепетівкагаз', 'INTERNET', 'реп'],
    'Поштові послуги': ['novapay', 'нова пошта', 'nova poshta', 'укрпошта', 'meest'],
    'Продукти': ['атб', 'atb', 'сільпо', 'сильпо', 'траш', 'thrash', 'велмарт', 'GWater', 'dobry pan', 'маркет', 'магазин', 'shop', 'roshen', 'NAPOI', 'фермер', 'лаваш', 'TARANENKO', 'MAGAZYN', 'кошик'],
    'Ресторани та Розваги': ['какао', 'coffee', 'wings', 'ENTIRZHI', 'Чудо', 'Ekspres', 'KAFETERIY', 'кавярня', 'Кафе', 'монастік', 'сушия', 'osama', 'Кав`ярня', 'kava', 'mcdonald', 'kfc', 'pizza', 'sushi', 'кебаб', 'буфет', 'RYBACHOK', 'shaurma', 'VAPE', 'VM', 'vape'],
    'Спорт': ['спорт', 'vovkulaky', 'biont'],
    'Техніка і цифрові товари': ['rozetka', 'aliexpress', 'temu', 'аврора', '15G.LOZOVA', 'КАНЦЕЛЯРIЯ', 'foxtrot', 'фотохатка', 'kristal', 'comics', 'Цифрові', 'amazon'],
    'Зняття готівки': ['зняття готівки', 'видача готівки'],
    
    # НАДХОДЖЕННЯ
    'Бонуси та Кешбек': ['кешбек', 'cashback', 'Abnk',  'винагорода'],
    'Зарплата і виплати': ['зарплата', 'соціальні виплати', 'грошове забезпечення', 'hroshove', 'zarobitna'],
    'Поповнення готівкою': ['city24', 'City24', 'термінал mono', 'поповнення через ibox'],
    'Переказ на власний рахунок': ['сідорськ', 'sidorsk', 'Сергій С.', 'власний рахунок', 'на свою картку'],
    'Переказ з власного рахунку': ['сідорськ', 'sidorsk', 'власний рахунок', 'зі своєї картки'],
}

### --- СПИСКИ ДЛЯ ЛОГІКИ ---
INCOME_CATEGORIES = ['Бонуси та Кешбек', 'Зарплата і виплати', 'Інші надходження', 'Переказ з власного рахунку', 'Переказ з чужого рахунку', 'Поповнення готівкою']
AMBIGUOUS_CATEGORIES = ['Переказ', 'Оплата', 'Інше', 'Нерозпізнана', 'Покупка', 'Перекази']

EXCEL_MAPPING = {
    "дата": COL_DATE, "категорія": COL_CAT, "картка": COL_CARD,
    "опис операції": COL_DESC, "сума в валюті картки": COL_AMOUNT,
    "залишок на кінець періоду": COL_BALANCE
}